Revit 2027 API
AssemblyMemberDifferentCategory.CategoryId2 Property
 Category id of the second assembly member
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CategoryId2 { get; }
Public ReadOnly Property CategoryId2 As ElementId
	Get
public:
property ElementId^ CategoryId2 {
	ElementId^ get ();
}
member CategoryId2 : ElementId with get
Property Value
ElementId
See Also
Reference
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace